init.org
#+property: header-args:emacs-lisp :tangle (concat (file-name-sans-extension (buffer-file-name)) ".el")
#+property: header-args :mkdirp yes :comments no
#+startup: indent

#+begin_src emacs-lisp :exports none
  ;; DO NOT EDIT THIS FILE DIRECTLY
  ;; This is a file generated from a literate programing source file located at
  ;; https://github.com/dpsutton/tangled-emacs/blob/master/init.org.
  ;; You should make any changes there and regenerate it from Emacs org-mode using C-c C-v t
#+end_src


#+title: My Emacs config file
#+author: Dan Sutton
#+email: dan@dpsutton.com

This is my emacs configuration file. I am basing this on the excellent version made by [[https://github.com/zzamboni/dot-emacs][zzamboni]]. I could have easily cloned his or her repo but I've never used org tangling before so I wanted to try this from scratch.

* Performance optimization.

#+BEGIN_SRC emacs-lisp
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "Emacs ready in in %s with %d garbage collections"
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))
#+END_SRC


Optionally enable =debug-on-error= when diagnosing errors with the config file itself.

#+begin_src emacs-lisp
  ;;(setq debug-on-error t)
#+end_src

#+begin_src emacs-lisp
  (setq personal/original-gc-threshold gc-cons-threshold)
  (setq gc-cons-threshold most-positive-fixnum)
#+end_src

* Customized variables
#+BEGIN_SRC emacs-lisp
  (setq custom-file "~/.emacs.d/custom.el")
  (when (file-exists-p custom-file)
   (load custom-file))
#+END_SRC

* Package Management

This is the first time I've used `use-package` but its about time I ventured into it.

** Setup package locations and refresh package contents

#+BEGIN_SRC emacs-lisp
  (customize-set-variable 'package-archives
                          '(("gnu"       . "https://elpa.gnu.org/packages/")
                            ("melpa" . "https://melpa.org/packages/")))
#+END_SRC

Now we initialize the package and install =use-package= if needed.

#+BEGIN_SRC emacs-lisp
  (package-initialize)

  (when (not package-archive-contents)
    (package-refresh-contents))
#+END_SRC

** Install and configure =use-package=

#+BEGIN_SRC emacs-lisp
  (when (not (package-installed-p 'use-package))
    (package-install 'use-package))

  (require 'use-package)
#+END_SRC

- The =use-package-always-ensure= variable indicates that =use-package= should always try to install missing packages. For some libraries this is not appropriate, and in those cases you see the =:ensure nil= declaration as part of the =use-package= statement. This applies mainly to libraries which are installed as part of some other package (happens mostly with some libraries that come with org-mode).

  #+BEGIN_SRC emacs-lisp
    (customize-set-variable 'use-package-always-ensure t)
  #+END_SRC

- The =use-package-verbose= variable allows for verbosity for debugging

  #+BEGIN_SRC emacs-lisp
    (customize-set-variable 'use-package-verbose nil)
  #+END_SRC

This variable tells Emacs to prefer the =.el= file if it's newer, even if there is a corresponding =.elc= file. Also, use =auto-compile= to autocompile files as needed.

#+BEGIN_SRC emacs-lisp
  (customize-set-variable 'load-prefer-newer t)
  (use-package auto-compile
    :defer nil
    :config (auto-compile-on-load-mode))
#+END_SRC
* Settings

** General

- set dired listing settings

#+BEGIN_SRC emacs-lisp
  (setq dired-listing-switches "-alh")
#+END_SRC

- Start the Emacs server and define a shutdown function

#+begin_src emacs-lisp
    (server-start)

  (defun shutdown-server ()
    "Kill the running emacs server.
  When running emacs client, easily kill the server without ps aux,
  pkill, etc."
    (interactive)
    (save-some-buffers)
    (kill-emacs))
#+end_src

- use resize-window

#+BEGIN_SRC emacs-lisp
  (use-package resize-window
    :demand t
    :bind
    ("C-c ;" . resize-window)
    ("C-c C-;" . resize-window)
    :config
    (add-hook 'org-mode-hook
              (lambda ()
                (bind-key "C-c ;" 'resize-window org-mode-map)))
    (setq resize-window-swap-capital-and-lowercase-behavior t)
    (resize-window-add-choice ?l #'ivy-switch-buffer "Switch buffers with ivy")
    (resize-window-add-choice ?a #'counsel-git "Search git files")
    (resize-window-add-choice ?h (lambda () (dired "~/projects/clojure"))
                              "Visit the clojure directory")
    (resize-window-add-choice ?d (lambda () (dired "~/projects/dev"))
                              "Visit dev directoryq")
    (resize-window-add-choice ?m (lambda () (resize-window--window-push))
                              "Push window state onto window stack"))
#+END_SRC

- turn off the stupid system bell

#+BEGIN_SRC emacs-lisp
  (setq ring-bell-function 'ignore)
#+END_SRC

- reload files when changed on disk

#+BEGIN_SRC emacs-lisp
  (global-auto-revert-mode t)
#+END_SRC
- Set up a way to hook up multiple modes

#+BEGIN_SRC emacs-lisp
  (defun append-suffix (suffix phrases)
    "take SUFFIX and append it to each of the PHRASES."
    (mapcar #'(lambda (phrase) (concat (symbol-name phrase) suffix)) phrases))

  (defun hook-up-modes (environments hook)
    (mapc (lambda (mode) (add-hook mode hook))
          (mapcar (lambda (env) (intern (format "%s-mode-hook" env)))
                  environments)))
#+END_SRC

- When at the beginning of the line, make =Ctrl-K= remove the whole line, instead of just emptying it.

  #+begin_src emacs-lisp
    (customize-set-variable 'kill-whole-line t)
  #+end_src

- Paste text where the cursor is, not where the mouse is.

  #+begin_src emacs-lisp
    (customize-set-variable 'mouse-yank-at-point t)
  #+end_src

- Make completion case-insensitive.

  #+begin_src emacs-lisp
    (setq completion-ignore-case t)
    (customize-set-variable 'read-file-name-completion-ignore-case t)
    (customize-set-variable 'read-buffer-completion-ignore-case t)
  #+end_src

- Highlight trailing whitespace in red, so it's easily visible

  #+begin_src emacs-lisp
    (customize-set-variable 'show-trailing-whitespace t)
  #+end_src

- Highlight matching parenthesis

  #+begin_src emacs-lisp
    (show-paren-mode)
  #+end_src

- Don't use hard tabs

  #+begin_src emacs-lisp
    (customize-set-variable 'indent-tabs-mode nil)
  #+end_src

- Emacs automatically creates backup files, by default in the same folder as the original file, which often leaves backup files behind. This tells Emacs to [[http://www.gnu.org/software/emacs/manual/html_node/elisp/Backup-Files.html][put all backups in ~/.emacs.d/backups]].

  #+begin_src emacs-lisp
    (customize-set-variable 'backup-directory-alist `(("." . ,(concat user-emacs-directory "backups"))))
  #+end_src

- [[http://emacswiki.org/emacs/WinnerMode][WinnerMode]] makes it possible to cycle and undo window configuration changes (i.e. arrangement of panels, etc.)

  #+begin_src emacs-lisp
    (when (fboundp 'winner-mode) (winner-mode))
  #+end_src

- Add "unfill" commands to parallel the "fill" ones, bind ~A-q~ to =unfill-paragraph= and rebind ~M-q~ to the =unfill-toggle= command, which fills/unfills paragraphs alternatively.

  #+begin_src emacs-lisp
    (use-package unfill
      :bind
      ("M-q" . unfill-toggle)
      ("A-q" . unfill-paragraph))
  #+end_src

- Save the place of the cursor in each file, and restore it upon opening it again.

  #+begin_src emacs-lisp
    (use-package saveplace
      :defer nil
      :config
      (save-place-mode))
  #+end_src

- Provide mode-specific "bookmarks" - press =M-i= and you will be presented with a list of elements to which you can navigate - they can be headers in org-mode, function names in emacs-lisp, etc.

  #+begin_src emacs-lisp
    (use-package imenu-anywhere
      :bind ("M-i" . imenu))
  #+end_src

- Smooth scrolling (line by line) instead of jumping by half-screens.

  #+begin_src emacs-lisp
    (use-package smooth-scrolling
      :disabled
      :config
      (smooth-scrolling-mode 1))
  #+end_src

- Delete trailing whitespace before saving a file.

  #+begin_src emacs-lisp
    (add-hook 'before-save-hook 'delete-trailing-whitespace)
  #+end_src

- Suppress "ad-handle-definition: .. redefined" warnings during Emacs startup.

  #+begin_src emacs-lisp
    (customize-set-variable 'ad-redefinition-action 'accept)
  #+end_src


- Use the =bind-key= package to more easily keep track and manage user keybindings. It comes with =use-package= so we can just load it.

The main benefit is that we can ~M-x~ =describe-personal-keybindings= to see a list of all the customized keybindings defined.

#+BEGIN_SRC emacs-lisp
  (require 'bind-key)
#+END_SRC


** Appearance

You'll notice that many of the packages in this section have =:defer nil=. This is because some of these package are never called explicitly because they operate in the background, but I want them loaded when Emacs starts so they can perform their necessary customization.

Emacs 26 (which I am trying now) introduces pixel-level scrolling.

#+begin_src emacs-lisp
  (when (>= emacs-major-version 26)
    (pixel-scroll-mode))
#+end_src


The =diminish= package makes it possible to remove clutter from the modeline. Here we just load it, it gets enabled for individual packages in their corresponding declarations.

#+begin_src emacs-lisp
  (use-package diminish
    :defer 1)

  (use-package minions
    :config (minions-mode))

  (use-package moody
    :config
    (setq x-underline-at-descent-line t)
    (moody-replace-mode-line-buffer-identification)
    (moody-replace-vc-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package uniquify
    :defer 1
    :ensure nil
    :custom
    (uniquify-after-kill-buffer-p t)
    (uniquify-buffer-name-style 'post-forward)
    (uniquify-strip-common-suffix t))
#+end_src

Install smart-mode-line

#+BEGIN_SRC emacs-lisp
  (use-package smart-mode-line
    :defer 2)
#+END_SRC

Identify the location of the cursor:

#+BEGIN_SRC emacs-lisp
(use-package hl-line
    :defer nil
    :config
    (global-hl-line-mode +1))
#+END_SRC

Turn off the quite ugly ui chrome

#+BEGIN_SRC emacs-lisp
  (tool-bar-mode -1)
#+END_SRC

*** Themes

#+begin_src emacs-lisp
  (use-package solarized-theme)
  (use-package darktooth-theme)
  (use-package kaolin-themes)
  (use-package sublime-themes)

  (use-package gruvbox-theme)
  (load-theme 'brin)
  (setq hl-line-face '((t :background "#3d424d")))
#+end_src



