init.org
** General Packages

=projectile-mode= allows us to perform project-relative operations such as searches, navigation, etc.

#+begin_src emacs-lisp
  (use-package projectile
    :defer 2
    :diminish projectile-mode
    :config
    (projectile-global-mode))
#+end_src

- The [[https://github.com/justbur/emacs-which-key][which-key]] package makes Emacs functionality much easier to discover and explore: in short, after you start the input of a command and stop, pondering what key must follow, it will automatically open a non-intrusive buffer at the bottom of the screen offering you suggestions for completing the command, that's it, nothing else. It's beautiful.

  #+begin_src emacs-lisp
    (use-package which-key
      :defer nil
      :diminish which-key-mode
      :config
      (which-key-mode))
  #+end_src

- Hydra allows for easily configured menus

#+BEGIN_SRC emacs-lisp
  (use-package hydra)
#+END_SRC

- crux

very convenient package from bbatsov

#+BEGIN_SRC emacs-lisp
    (use-package crux
      :bind
      ([remap kill-whole-line] . crux-kill-whole-line)
      ("C-c n" . crux-cleanup-buffer-or-region)
      ("C-M-z" . crux-indent-defun)
      ("C-c t" . crux-visit-term-buffer)
      ("C-a" . crux-move-beginning-of-line)
      :config
      (require 'crux)
      (crux-with-region-or-line kill-region))
#+END_SRC

*** Completion

=company-mode= for completion

#+BEGIN_SRC emacs-lisp
  (use-package company
    :diminish company-mode
    :bind ("TAB" . company-indent-or-complete-common)
    :hook
    (after-init . global-company-mode)
    :config
    (setq company-idle-delay 0.3)
    (setq company-minimum-prefix-length 3))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package company-quickhelp
    :init (company-quickhelp-mode)
    :config
    (setq company-quickhelp-use-propertized-text t)
    (setq company-quickhelp-delay 0.2))
#+END_SRC

** Neotree/sidebar

#+begin_src emacs-lisp
  (use-package all-the-icons)
  (use-package neotree
    :config
    (customize-set-variable 'neo-theme (if (display-graphic-p) 'icons 'arrow))
    (customize-set-variable 'neo-smart-open t)
    ;;(customize-set-variable 'projectile-switch-project-action 'neotree-projectile-action)
    (defun neotree-project-dir ()
      "Open NeoTree using the git root."
      (interactive)
      (let ((project-dir (projectile-project-root))
            (file-name (buffer-file-name)))
        (neotree-toggle)
        (if project-dir
            (if (neo-global--window-exists-p)
                (progn
                  (neotree-dir project-dir)
                  (neotree-find file-name)))
          (message "Could not find git project root."))))
    :bind
    ([f8] . neotree-project-dir))
#+end_src


* Text Editing Settings

** Text environment hook
Define standard text environments

#+BEGIN_SRC emacs-lisp
  (defvar my-text-environments '(org markdown))
#+END_SRC

Turn off whitespace mode and make word wrapping work as in a normal text editor.

#+BEGIN_SRC emacs-lisp
  (defun standard-text-environment ()
    (visual-line-mode)
    (whitespace-mode -1))

  (hook-up-modes my-text-environments 'standard-text-environment)
#+END_SRC

** General

Tab settings. No tabs inserted but tabs have a width of 8.

#+BEGIN_SRC emacs-lisp
  (setq-default indent-tabs-mode nil)
  (setq tab-width 8)
#+END_SRC

** Scrolling

Scolling will recenter which leaves the repl prompt in the middle of the buffer just wasting tons of space. Prefer to have it just stay right above the bottom. Can do this with =scroll-conservatively= with a value greater than 100.

#+BEGIN_SRC emacs-lisp
  (setq scroll-conservatively 101)
#+END_SRC
** Copy/Paste related

#+BEGIN_SRC emacs-lisp
  (use-package browse-kill-ring
    :demand t
    :config
    (browse-kill-ring-default-keybindings)
    :bind
    ("s-y" . browse-kill-ring))
#+END_SRC

Allow for pasting over things

#+BEGIN_SRC emacs-lisp
  (delete-selection-mode 1)
#+END_SRC
** Undo

Use undo tree

#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
    :diminish undo-tree-mode
    :init
    (global-undo-tree-mode)
    (setq undo-tree-visualizer-timestamps t)
    (setq undo-tree-visualizer-diff t))

#+END_SRC

** Text size

#+BEGIN_SRC emacs-lisp
  (bind-key "C-+" 'text-scale-increase)
  (bind-key "C--" 'text-scale-decrease)
#+END_SRC

* Pdf

#+BEGIN_SRC emacs-lisp
  (use-package pdf-tools
    :demand t
    :config
    (require 'pdf-tools)
    (require 'pdf-view)
    :bind (:map pdf-view-mode-map
                ("j" . pdf-view-next-line-or-next-page)
                ("k" . pdf-view-previous-line-or-previous-page)
                ("h" . image-backward-hscroll)
                ("l" . image-forward-hscroll)))
#+END_SRC
* Org

** Initial setup

Org is lovely except i prefer my =resize-window= command at =C-c ;= instead of the toggle comment command.

#+BEGIN_SRC emacs-lisp
  (use-package org
    :bind
    ([remap org-toggle-comment] . resize-window))
#+END_SRC

** Presentations

Using instructions for org-reveal from https://github.com/yjwen/org-reveal/

#+BEGIN_SRC emacs-lisp
  (use-package ox-reveal
    :config
    (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js"))
#+END_SRC

htmlize so that code blocks use emacs theme
#+BEGIN_SRC emacs-lisp
  (use-package htmlize)
#+END_SRC
* Searching

** Ibuffer

This seems quite powerful but I never think to use it. Need to read the help menu under =h= when in =ibuffer-mode=
#+begin_src emacs-lisp
  (use-package ibuffer
    :bind
    ("C-x C-b" . ibuffer))
#+end_src

** Interactive search

- Interactive search key bindings -  [[https://github.com/benma/visual-regexp-steroids.el][visual-regexp-steroids]] provides sane regular expressions and visual incremental search. We make ~C-s~ and ~C-r~ run the visual-regexp functions. We leave ~C-M-s~ and ~C-M-r~ to run the default =isearch-forward/backward= functions, as a fallback. I use the =pcre2el= package to support PCRE-style regular expressions.

  #+begin_src emacs-lisp
    (use-package pcre2el)
    (use-package visual-regexp-steroids
      :custom
      (vr/engine 'pcre2el "Use PCRE regular expressions")
      :bind
      ("C-c r" . vr/replace)
      ("C-c q" . vr/query-replace)
      ("C-r"   . vr/isearch-backward)
      ("C-S-s" . vr/isearch-forward)
      ("C-M-s" . isearch-forward)
      ("C-M-r" . isearch-backward))
  #+end_src

** Loccur

#+BEGIN_SRC emacs-lisp
  (use-package loccur
    :bind ("C-o" . loccur-current))
#+END_SRC

** Ivy

Enable. In my last config i saw that i included =(setq enable-recursive-minibuffers t)= but I don't remember why I did this. Perhaps will be necessary? Sure is nice to have literate docs.

Define my own "thing at point" ag function

#+BEGIN_SRC emacs-lisp
  (defun personal/ag-at-point ()
    (interactive)
    (let ((current-word (thing-at-point 'symbol)))
      (counsel-ag current-word)))

#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :demand t
    :bind
    ("C-c C-r" . ivy-resume)
    :config
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :bind
    ("M-x" . counsel-M-x)
    ("C-r" . personal/ag-at-point)
    ("C-x C-f" . counsel-find-file)
    ("C-x l" . counsel-locate)
    ("C-S-o" . counsel-rhythmbox)
    ("C-s" . swiper))
#+END_SRC
* Coding

** All

*** Standard packages

- paredit

#+BEGIN_SRC emacs-lisp
    (use-package paredit)
#+END_SRC

- rainbow delimiters mode

#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters)
#+END_SRC

- magit

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :bind ("C-x g" . magit-status))
#+END_SRC

*** Keybindings

*** eldoc

#+BEGIN_SRC emacs-lisp
  (use-package eldoc
    :diminish
    :hook
    (prog-mode . turn-on-eldoc-mode))
#+END_SRC

*** flycheck

#+BEGIN_SRC emacs-lisp
(use-package flycheck)
#+END_SRC

** Lisps

Standard lisp editing environment
#+BEGIN_SRC emacs-lisp
  (defun standard-lisp-environment ()
    (paredit-mode 1)
    (rainbow-delimiters-mode 1)
    (eldoc-mode 1))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defconst personal/my-lisps '(clojure lisp emacs-lisp cider-repl
                                        ;; geiser geiser-repl racket scheme slime repl
                                        ))

  (hook-up-modes personal/my-lisps #'standard-lisp-environment)

#+END_SRC
** Shells

#+BEGIN_SRC emacs-lisp
  (bind-key "C-x m" 'eshell)
  (bind-key "C-x M" (lambda () (interactive) (eshell t)))
#+END_SRC

*** fish
#+BEGIN_SRC emacs-lisp
  (use-package fish-mode)

#+END_SRC

** Yasnippet

Need yasnippet for lsp-mode. And why not. It's a good thing

#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :demand t
    :config
    (yas-global-mode 1)
    (setq yas-snippet-dirs (list "~/.emacs.d/snippets")))
#+END_SRC
** Clojure

*** CIDER

Get the dependencies for cider

#+BEGIN_SRC emacs-lisp
  (use-package parseedn)
  (use-package pkg-info)
  (use-package queue)
  (use-package spinner)
  (use-package seq)
  (use-package sesman)
  (use-package flycheck-joker)
  (use-package buttercup)
#+END_SRC


Clojure mode and CIDER are dev versions locally

#+BEGIN_SRC emacs-lisp

    (use-package clojure-mode
      :load-path "~/projects/dev/clojure-mode"
      :config
      (setq clojure-toplevel-inside-comment-form t)
      (setq clojure-indent-style 'align-arguments)
      (put-clojure-indent 'dofor 1)
      (put-clojure-indent 'match 1)

      (put-clojure-indent 'context 1)
      (put-clojure-indent 'GET 1)
      (put-clojure-indent 'compojure/GET 1)
      (put-clojure-indent 'compojure/POST 1)
      (put-clojure-indent 'compojure/PATCH 1)
      (put-clojure-indent 'compojure/PUT 1)
      (put-clojure-indent 'compojure/DELETE 1)
      (put-clojure-indent 'POST 1)
      (put-clojure-indent 'PATCH 1)
      (put-clojure-indent 'DELETE 1))

    (use-package cider
      :load-path "~/projects/dev/cider/"
      :init
      (load "cider-autoloads" t t)
      :config
      (setq cider-invert-insert-eval-p t)
      (setq cider-switch-to-repl-after-insert-p nil)
      (setq cider-switch-to-repl-on-insert-p nil)
      (setq cider-font-lock-dynamically t)
      (setq cider-show-error-buffer nil)
      (setq cider-repl-display-help-banner nil)
      (setq cider-repl-pop-to-buffer-on-connect 'display-only)
      (setq cider-repl-tab-command #'company-indent-or-complete-common)
      :bind (:map
             cider-repl-mode-map
             ("RET" . cider-repl-newline-and-indent)
             ("C-j" . cider-repl-return)
             :map
             paredit-mode-map
             ("C-j" . cider-repl-return))
  )
#+END_SRC

****  tooltip for doc stuff
#+BEGIN_SRC emacs-lisp
  (use-package pos-tip)

  (defun cider-tooltip-show ()
    (interactive)
    (if-let ((info (cider-var-info (thing-at-point 'symbol))))
        (nrepl-dbind-response info (doc arglists-str name ns)
          (pos-tip-show (format "%s : %s\n%s\n%s" ns (or name "") (or arglists-str "") (or doc ""))
                        nil
                        nil
                        nil
                        -1))
      (message "info not found")))

  (bind-key "C-c t" 'cider-tooltip-show)
#+END_SRC
