init.org
*** LSP
indent-region-function


Use lsp-mode with the excellent lsp-clojure package.

#+BEGIN_SRC emacs-lisp
  (use-package lsp-mode
    :init
    (setq lsp-clojure-server-command '("bash" "-c" "cd ~/projects/clojure/clojure-lsp && lein run"))
    (setq lsp-enable-indentation nil)
    (setq lsp-enable-completion-at-point nil)
    ;; (setq indent-region-function #'clojure-indent-function)
    (add-hook 'clojure-mode-hook #'lsp)
    (add-hook 'clojurec-mode-hook #'lsp)
    (add-hook 'clojurescript-mode-hook #'lsp)
    :config
    (require 'lsp-clojure)
    (add-to-list 'lsp-language-id-configuration '(clojure-mode . "clojure"))
    (add-to-list 'lsp-language-id-configuration '(clojurec-mode . "clojure"))
    (add-to-list 'lsp-language-id-configuration '(clojurescript-mode . "clojurescript")))
#+END_SRC

Use the hydra I cooked up recently

#+BEGIN_SRC emacs-lisp
  (use-package lsp-clojure-hydra
    :after (lsp-mode lsp-mode cider)
    :load-path "~/projects/elisp/lsp-clojure-hydra"
    :bind (("C-c C-l" . lsp-clojure-refactor-menu/body)
           :map
           cider-mode-map
           ("C-c C-l" . lsp-clojure-refactor-menu/body)))
#+END_SRC
** Rust

#+BEGIN_SRC emacs-lisp
  (use-package rust-mode)
  (use-package racer
    :config
    (add-hook 'rust-mode-hook #'racer-mode)
    (add-hook 'racer-mode-hook #'eldoc-mode)
    (add-hook 'racer-mode-hook #'company-mode)
    (setq company-tooltip-align-annotations t)
    :bind (:map
           rust-mode-map
           ("TAB" . company-indent-or-complete-common)))
#+END_SRC
** Elm

Packages for elm-mode

#+BEGIN_SRC emacs-lisp
  (use-package elm-mode)
  (use-package flycheck-elm)
#+END_SRC
** Haskell
#+BEGIN_SRC emacs-lisp
  (use-package haskell-mode)
#+END_SRC
install intero
#+BEGIN_SRC emacs-lisp
  (use-package dante
    :ensure t
    :after haskell-mode
    :init
    (add-hook 'haskell-mode-hook 'flycheck-mode)
    (add-hook 'haskell-mode-hook 'dante-mode))

#+END_SRC
* Machine Configs
** Work

Var to check that we are on the work machine
#+BEGIN_SRC emacs-lisp
  (defconst personal/work-machine (string= system-name "dan-aclaimant-mbp.local"))
#+END_SRC
*** Connect to running services

#+BEGIN_SRC emacs-lisp
  (when personal/work-machine
    (defmacro aclaimant-cider-connection (name&dir port)
      `(defun ,(intern (format "aclaimant-jack-in-%s" (symbol-name name&dir))) ()
         ,(format "Jack into project %s and open its base directory." name&dir)
         (interactive)
         (let ((dir ,(format "~/projects/aclaimant/acl/src/aclaimant/"
                             (symbol-name name&dir))))
           (cider-connect (list :host "local.aclaimant.com" :port ,port
                                :project-dir dir)))))

    (defun personal/aclaimant-connect (name&dir host port options)
      (let ((dir (format "~/projects/aclaimant/acl/src/aclaimant/" (symbol-name name&dir))))
        (cider-connect (append (list :host host :port port
                                     :project-dir dir)
                               options))))

    (aclaimant-cider-connection service 7000)
    (aclaimant-cider-connection jobs 7001)
    (aclaimant-cider-connection alerter 7002)
    (aclaimant-cider-connection twilio 7004)

    (defun aclaimant-jack-in-dashboard ()
      (interactive)
      (cider-connect-cljs (list :host "localhost"
                                :port 7888
                                :cljs-repl-type 'figwheel-connected
                                'project-dir "~/projects/aclaimant/acl")))

    (resize-window-add-choice ?u (lambda () (dired "~/projects/aclaimant/acl"))
                              "Work projects"))

#+END_SRC
*** Font size

#+BEGIN_SRC emacs-lisp
  (when personal/work-machine
    (defun personal/set-font ()
      (interactive)
      (set-face-attribute 'default nil :height 140))

    (personal/set-font))
#+END_SRC

*** TODO Ligatures

Switch away from ligatures hoping to diagnose some memory woes on osx. Need that sweet sweet shell though

#+BEGIN_SRC emacs-lisp
  (use-package exec-path-from-shell
    :demand t
    :init
    (exec-path-from-shell-initialize))
#+END_SRC

*** Random assorteds

#+BEGIN_SRC emacs-lisp
  (when personal/work-machine
    (setq mac-command-modifier 'meta)
    (global-display-line-numbers-mode +1))
#+END_SRC
** Linux machine

are we on that machine?

#+BEGIN_SRC emacs-lisp
  (defconst personal/linux-machine (string= system-name "pop-os"))
#+END_SRC


*** Font size

thinkpad machine has a 2500 screen and needs "manual" scaling. Work machine scales better. Year of the linux desktop

#+BEGIN_SRC emacs-lisp
  (when personal/linux-machine
    (defun personal/set-font ()
      (interactive)
      (set-face-attribute 'default nil :height 130)))
#+END_SRC
** Any

*** Set font

For some reason this was getting lost in the startup shenanigans so we set it once things settle down.

#+BEGIN_SRC emacs-lisp
  (set-frame-font "Fira Code")
  (run-with-idle-timer 0 nil #'personal/set-font)
#+END_SRC

*** TODO

* Post

** Restore gc

#+BEGIN_SRC emacs-lisp
  (setq gc-cons-threshold personal/original-gc-threshold)
#+END_SRC
