init.el

(use-package lsp-mode
  :init
  (setq lsp-clojure-server-command '("bash" "-c" "cd ~/projects/clojure/clojure-lsp && lein run"))
  (setq lsp-enable-indentation nil)
  ;; (setq indent-region-function #'clojure-indent-function)
  (add-hook 'clojure-mode-hook #'lsp)
  (add-hook 'clojurec-mode-hook #'lsp)
  (add-hook 'clojurescript-mode-hook #'lsp)
  :config
  (require 'lsp-clojure))

(use-package lsp-clojure-hydra
  :after (lsp-mode lsp-mode cider)
  :load-path "~/projects/elisp/lsp-clojure-hydra"
  :bind (("C-c C-l" . lsp-clojure-refactor-menu/body)
         :map
         cider-mode-map
         ("C-c C-l" . lsp-clojure-refactor-menu/body)))

(defconst personal/work-machine (string= system-name "dan-aclaimant-mbp.local"))

(when personal/work-machine
  (defmacro aclaimant-cider-connection (name&dir port)
    `(defun ,(intern (format "aclaimant-jack-in-%s" (symbol-name name&dir))) ()
       ,(format "Jack into project %s and open its base directory." name&dir)
       (interactive)
       (let ((dir ,(format "~/projects/aclaimant/acl/src/aclaimant/"
                           (symbol-name name&dir))))
         (cider-connect (list :host "local.aclaimant.com" :port ,port
                              :project-dir dir)))))

  (defun personal/aclaimant-connect (name&dir host port options)
    (let ((dir (format "~/projects/aclaimant/acl/src/aclaimant/" (symbol-name name&dir))))
      (cider-connect (append (list :host host :port port
                                   :project-dir dir)
                             options))))

  (aclaimant-cider-connection service 7000)
  (aclaimant-cider-connection jobs 7001)
  (aclaimant-cider-connection alerter 7002)
  (aclaimant-cider-connection twilio 7004)

  (defun aclaimant-jack-in-dashboard ()
    (interactive)
    (cider-connect-cljs (list :host "localhost"
                              :port 7888
                              :cljs-repl-type 'figwheel-connected
                              'project-dir "~/projects/aclaimant/acl")))

  (resize-window-add-choice ?u (lambda () (dired "~/projects/aclaimant/acl"))
                            "Work projects"))
